In [1]:
import pandas as pd;
import numpy as np;

In [4]:
dict1 = {
    "Name": ["Devansh", "Ravi", "David", "Vasu"],
    "Marks": [98,65,76,84],
    "Class": [12,11,9,7]
}

In [7]:
df = pd.DataFrame(dict1)
df

      Name  Marks  Class
0  Devansh     98     12
1     Ravi     65     11
2    David     76      9
3     Vasu     84      7

In [1]:
df.to_csv("dict.csv")

NameError: name 'df' is not defined

In [9]:
df.to_csv("dict_no_index.csv", index = False)

In [10]:
df.head(2)

      Name  Marks  Class
0  Devansh     98     12
1     Ravi     65     11

In [11]:
df.tail(2)

    Name  Marks  Class
2  David     76      9
3   Vasu     84      7

In [12]:
df.describe()

           Marks      Class
count   4.000000   4.000000
mean   80.750000   9.750000
std    13.889444   2.217356
min    65.000000   7.000000
25%    73.250000   8.500000
50%    80.000000  10.000000
75%    87.500000  11.250000
max    98.000000  12.000000

In [13]:
df = pd.read_csv("Book1.csv")

In [ ]:
df

  Train  Number  Seat
0   ABC     1004  HY3
1   DEF     2014  KO2
2   GHI     8723  NJ3
3   JKL     5437  BH2

In [17]:
df["Seat"][1]

'KO2'

In [22]:
df["Seat"][2] = "WN5"

<ipython-input-22-b5c160a08a30>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Seat"][2] = "WN5"

In [23]:
df

  Train  Number  Seat
0   ABC     1004  HY3
1   DEF     2014  KO2
2   GHI     8723  WN5
3   JKL     5437  BH2

In [24]:
df.index = ["First", "Second", "Third", "Fourth"]

In [25]:
df

       Train  Number  Seat
First    ABC     1004  HY3
Second   DEF     2014  KO2
Third    GHI     8723  WN5
Fourth   JKL     5437  BH2

In [27]:
#Pandas is an open source data analysis library written in Python.
#It leverages the power and speed of numpy (written in C) to make data analysis and processing easy for data scientists.
#It provides rich and highly robust data operations.

In [28]:
#Pandas have two types of data structures:
#SERIES: One dimensional array (Stores single column data) (Holds single data type)
#DATAFRAMES: Two dimensional data (Stores the table) (Holds variety of data types)

In [32]:
series = pd.Series(np.random.rand(10))

In [35]:
series

0    0.373318
1    0.837086
2    0.667507
3    0.864311
4    0.505920
5    0.548313
6    0.892484
7    0.513916
8    0.011433
9    0.878099
dtype: float64

In [36]:
type(series)

pandas.core.series.Series

In [71]:
newdf = pd.DataFrame(np.random.rand(656,5))

In [72]:
newdf

            0         1         2         3         4
0    0.572389  0.094181  0.428379  0.407079  0.604743
1    0.777449  0.813203  0.363148  0.542015  0.043320
2    0.606300  0.386972  0.914306  0.907784  0.620629
3    0.533323  0.300016  0.216505  0.962230  0.866204
4    0.557107  0.096059  0.877642  0.830525  0.984698
..        ...       ...       ...       ...       ...
651  0.200125  0.839864  0.887887  0.552293  0.303394
652  0.628054  0.734664  0.484412  0.365472  0.055773
653  0.791533  0.598417  0.932812  0.477413  0.986886
654  0.570368  0.576088  0.169085  0.956737  0.556501
655  0.715831  0.250149  0.831169  0.561204  0.225498

[656 rows x 5 columns]

In [73]:
type(newdf)

pandas.core.frame.DataFrame

In [74]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [75]:
newdf[0][1] = "Dev"
newdf.head(5)

          0         1         2         3         4
0  0.572389  0.094181  0.428379  0.407079  0.604743
1       Dev  0.813203  0.363148  0.542015  0.043320
2    0.6063  0.386972  0.914306  0.907784  0.620629
3  0.533323  0.300016  0.216505  0.962230  0.866204
4  0.557107  0.096059  0.877642  0.830525  0.984698

In [76]:
newdf.index

RangeIndex(start=0, stop=656, step=1)

In [77]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [78]:
newdf.T #Transpose

,0,1,2,3,4,5,6,7,8,9,...,646,647,648,649,650,651,652,653,654,655
0,0.572389,Dev,0.6063,0.533323,0.557107,0.15249,0.320887,0.439311,0.637883,0.675777,...,0.40966,0.37614,0.962113,0.547565,0.924561,0.200125,0.628054,0.791533,0.570368,0.715831
1,0.094181,0.813203,0.386972,0.300016,0.096059,0.859041,0.353062,0.726839,0.27056,0.731227,...,0.433657,0.974796,0.675502,0.197809,0.959615,0.839864,0.734664,0.598417,0.576088,0.250149
2,0.428379,0.363148,0.914306,0.216505,0.877642,0.470481,0.599178,0.868879,0.967742,0.333457,...,0.193535,0.873042,0.719171,0.441947,0.65997,0.887887,0.484412,0.932812,0.169085,0.831169
3,0.407079,0.542015,0.907784,0.96223,0.830525,0.61623,0.478493,0.299552,0.698619,0.38419,...,0.137874,0.656879,0.082518,0.634247,0.628053,0.552293,0.365472,0.477413,0.956737,0.561204
4,0.604743,0.04332,0.620629,0.866204,0.984698,0.210537,0.431957,0.344958,0.727552,0.994044,...,0.309101,0.140386,0.974849,0.141836,0.444692,0.303394,0.055773,0.986886,0.556501,0.225498

In [79]:
newdf.to_numpy()

array([[0.5723890052269834, 0.09418136073661243, 0.42837940902354954,
        0.4070794584799463, 0.604743054795642],
       ['Dev', 0.8132025292079357, 0.3631481137431626,
        0.5420149812185187, 0.04332001444750988],
       [0.6062996637034196, 0.38697201281164284, 0.9143064269155262,
        0.9077840395669026, 0.6206291665928263],
       ...,
       [0.7915330536526203, 0.5984170073396862, 0.9328122520878024,
        0.4774132252865567, 0.9868861831344372],
       [0.570368224688835, 0.5760882974231747, 0.16908473366150234,
        0.956737196758488, 0.5565006661266177],
       [0.7158312687455806, 0.25014860084214874, 0.8311685092902263,
        0.5612041946712083, 0.22549803277434743]], dtype=object)

In [80]:
newdf.sort_index(axis = 0, ascending = False)

            0         1         2         3         4
655  0.715831  0.250149  0.831169  0.561204  0.225498
654  0.570368  0.576088  0.169085  0.956737  0.556501
653  0.791533  0.598417  0.932812  0.477413  0.986886
652  0.628054  0.734664  0.484412  0.365472  0.055773
651  0.200125  0.839864  0.887887  0.552293  0.303394
..        ...       ...       ...       ...       ...
4    0.557107  0.096059  0.877642  0.830525  0.984698
3    0.533323  0.300016  0.216505  0.962230  0.866204
2      0.6063  0.386972  0.914306  0.907784  0.620629
1         Dev  0.813203  0.363148  0.542015  0.043320
0    0.572389  0.094181  0.428379  0.407079  0.604743

[656 rows x 5 columns]

In [81]:
newdf.sort_index(axis = 1, ascending = False)

            4         3         2         1         0
0    0.604743  0.407079  0.428379  0.094181  0.572389
1    0.043320  0.542015  0.363148  0.813203       Dev
2    0.620629  0.907784  0.914306  0.386972    0.6063
3    0.866204  0.962230  0.216505  0.300016  0.533323
4    0.984698  0.830525  0.877642  0.096059  0.557107
..        ...       ...       ...       ...       ...
651  0.303394  0.552293  0.887887  0.839864  0.200125
652  0.055773  0.365472  0.484412  0.734664  0.628054
653  0.986886  0.477413  0.932812  0.598417  0.791533
654  0.556501  0.956737  0.169085  0.576088  0.570368
655  0.225498  0.561204  0.831169  0.250149  0.715831

[656 rows x 5 columns]

In [82]:
newdf.loc[0,0] = "XYZ"

In [83]:
newdf.head()

          0         1         2         3         4
0       XYZ  0.094181  0.428379  0.407079  0.604743
1       Dev  0.813203  0.363148  0.542015  0.043320
2    0.6063  0.386972  0.914306  0.907784  0.620629
3  0.533323  0.300016  0.216505  0.962230  0.866204
4  0.557107  0.096059  0.877642  0.830525  0.984698

In [84]:
newdf.columns = list("ABCDE")

In [85]:
newdf.head()

          A         B         C         D         E
0       XYZ  0.094181  0.428379  0.407079  0.604743
1       Dev  0.813203  0.363148  0.542015  0.043320
2    0.6063  0.386972  0.914306  0.907784  0.620629
3  0.533323  0.300016  0.216505  0.962230  0.866204
4  0.557107  0.096059  0.877642  0.830525  0.984698

In [87]:
newdf.loc[0][0]

'XYZ'

In [97]:
newdf.loc[0]["A"] = 53

<ipython-input-97-45adf675a653>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf.loc[0]["A"] = 53

In [101]:
newdf.head()

          A         B         C         D         E
0       XYZ  0.094181  0.428379  0.407079  0.604743
1       Dev  0.813203  0.363148  0.542015  0.043320
2    0.6063  0.386972  0.914306  0.907784  0.620629
3  0.533323  0.300016  0.216505  0.962230  0.866204
4  0.557107  0.096059  0.877642  0.830525  0.984698

In [102]:
newdf.drop("E", axis = 1)

            A         B         C         D
0         XYZ  0.094181  0.428379  0.407079
1         Dev  0.813203  0.363148  0.542015
2      0.6063  0.386972  0.914306  0.907784
3    0.533323  0.300016  0.216505  0.962230
4    0.557107  0.096059  0.877642  0.830525
..        ...       ...       ...       ...
651  0.200125  0.839864  0.887887  0.552293
652  0.628054  0.734664  0.484412  0.365472
653  0.791533  0.598417  0.932812  0.477413
654  0.570368  0.576088  0.169085  0.956737
655  0.715831  0.250149  0.831169  0.561204

[656 rows x 4 columns]

In [104]:
newdf.loc[[1,2], ["C","D"]]

          C         D
1  0.363148  0.542015
2  0.914306  0.907784

In [105]:
newdf.loc[:, ["B", "C"]]

            B         C
0    0.094181  0.428379
1    0.813203  0.363148
2    0.386972  0.914306
3    0.300016  0.216505
4    0.096059  0.877642
..        ...       ...
651  0.839864  0.887887
652  0.734664  0.484412
653  0.598417  0.932812
654  0.576088  0.169085
655  0.250149  0.831169

[656 rows x 2 columns]

In [110]:
newdf.loc[(newdf["B"]>0.4) & (newdf["C"] <0.05)]

            A         B         C         D         E
57   0.246638  0.886048  0.018947  0.305184  0.620731
210  0.631648  0.808872  0.006885  0.577642  0.391953
250  0.657474  0.878373  0.040947  0.930049  0.003302
273  0.997622  0.999240  0.048908  0.735744  0.855058
275  0.536074  0.884752  0.021390  0.890835  0.706028
285   0.01453  0.646251  0.041161  0.967147  0.805820
338   0.55929  0.505142  0.007502  0.215483  0.511643
373  0.693086  0.827781  0.027920  0.936133  0.930883
389  0.932753  0.724432  0.005368  0.540614  0.566715
412  0.571606  0.912436  0.037952  0.723494  0.821366
482  0.755324  0.847693  0.032285  0.159648  0.019319
502  0.388195  0.975452  0.031934  0.876148  0.805276
539  0.784767  0.935589  0.022630  0.725859  0.374835
567  0.401448  0.704022  0.006224  0.421088  0.594454
577    0.2602  0.682168  0.026941  0.889672  0.082294
592  0.355262  0.742470  0.042480  0.361811  0.728469
611  0.651891  0.804641  0.029864  0.678533  0.871171
614  0.811437  0.838936  0.009941  0.801622  0.935061

In [111]:
newdf.iloc[0,4]

0.604743054795642

In [118]:
newdf.iloc[[0,1], 1:4]

          B         C         D
0  0.094181  0.428379  0.407079
1  0.813203  0.363148  0.542015

In [125]:
newdf.drop([2,4])
newdf.drop(["A", "C"], axis = 1)

            B         D         E
0    0.094181  0.407079  0.604743
1    0.813203  0.542015  0.043320
2    0.386972  0.907784  0.620629
3    0.300016  0.962230  0.866204
4    0.096059  0.830525  0.984698
..        ...       ...       ...
651  0.839864  0.552293  0.303394
652  0.734664  0.365472  0.055773
653  0.598417  0.477413  0.986886
654  0.576088  0.956737  0.556501
655  0.250149  0.561204  0.225498

[656 rows x 3 columns]

In [127]:
newdf.loc[:,["A"]] = 69

<ipython-input-127-ba5013f6570c>:1: DeprecationWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  newdf.loc[:,["A"]] = 69

In [129]:
newdf.head()

    A         B         C         D         E
0  69  0.094181  0.428379  0.407079  0.604743
1  69  0.813203  0.363148  0.542015  0.043320
2  69  0.386972  0.914306  0.907784  0.620629
3  69  0.300016  0.216505  0.962230  0.866204
4  69  0.096059  0.877642  0.830525  0.984698

In [130]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [131]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [134]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [135]:
df.isnull()

        Train  Number    Seat
First   False    False  False
Second  False    False  False
Third   False    False  False
Fourth  False    False  False

In [136]:
df.sum()

Train      ABCDEFGHIJKL
Number            17178
Seat       HY3KO2WN5BH2
dtype: object

In [140]:
df.mean()

<ipython-input-140-c61f0c8f89b5>:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Number     4294.5
dtype: float64

In [141]:
df.corr()

<ipython-input-141-2f6f6606aa2c>:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

         Number
Number       1.0

In [142]:
df.max()

Train       JKL
Number     8723
Seat        WN5
dtype: object

In [143]:
df.min()

Train       ABC
Number     1004
Seat        BH2
dtype: object

In [144]:
df.std()

<ipython-input-144-ce97bb7eaef8>:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

Number     3509.272907
dtype: float64